> 

I tried your attempt and it succeed on myside.

terraform apply --auto-approve
data.azurerm_client_config.current: Reading...
azurerm_resource_group.example: Refreshing state... [id=/subscriptions/85b3dbca-5974-4067-9669-67a141095a76/resourceGroups/KustoRGyun]
data.azurerm_client_config.current: Read complete after 0s [id=2022-11-11 04:14:11.3255693 +0000 UTC]
azurerm_kusto_cluster.example: Refreshing state... [id=/subscriptions/85b3dbca-5974-4067-9669-67a141095a76/resourceGroups/KustoRGyun/providers/Microsoft.Kusto/Clusters/kustoclusteryun111]
azurerm_kusto_database.example: Refreshing state... [id=/subscriptions/85b3dbca-5974-4067-9669-67a141095a76/resourceGroups/KustoRGyun/providers/Microsoft.Kusto/Clusters/kustoclusteryun111/Databases/KustoDatabaseyun111]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_kusto_cluster.example will be updated in-place
  ~ resource "azurerm_kusto_cluster" "example" {
        id                            = "/subscriptions/85b3dbca-5974-4067-9669-67a141095a76/resourceGroups/KustoRGyun/providers/Microsoft.Kusto/Clusters/kustoclusteryun111"
        name                          = "kustoclusteryun111"
        tags                          = {}
        # (14 unchanged attributes hidden)

      + identity {
          + identity_ids = (known after apply)
          + type         = "UserAssigned"
        }

        # (1 unchanged block hidden)
    }

  # azurerm_kusto_database_principal_assignment.example will be created
  + resource "azurerm_kusto_database_principal_assignment" "example" {
      + cluster_name        = "kustoclusteryun111"
      + database_name       = "KustoDatabaseyun111"
      + id                  = (known after apply)
      + name                = "KustoPrincipalAssignmentyun111"
      + principal_id        = (known after apply)
      + principal_name      = (known after apply)
      + principal_type      = "App"
      + resource_group_name = "KustoRGyun"
      + role                = "Viewer"
      + tenant_id           = "72f988bf-86f1-41af-91ab-2d7cd011db47"
      + tenant_name         = (known after apply)
    }

  # azurerm_user_assigned_identity.user_identity will be created
  + resource "azurerm_user_assigned_identity" "user_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "user_assigned_identity"
      + principal_id        = (known after apply)
      + resource_group_name = "KustoRGyun"
      + tenant_id           = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
azurerm_user_assigned_identity.user_identity: Creating...
azurerm_user_assigned_identity.user_identity: Creation complete after 8s [id=/subscriptions/85b3dbca-5974-4067-9669-67a141095a76/resourceGroups/KustoRGyun/providers/Microsoft.ManagedIdentity/userAssignedIdentities/user_assigned_identity]
azurerm_kusto_cluster.example: Modifying... [id=/subscriptions/85b3dbca-5974-4067-9669-67a141095a76/resourceGroups/KustoRGyun/providers/Microsoft.Kusto/Clusters/kustoclusteryun111]
azurerm_kusto_cluster.example: Still modifying... [id=/subscriptions/85b3dbca-5974-4067-9669-...soft.Kusto/Clusters/kustoclusteryun111, 10s elapsed]
azurerm_kusto_cluster.example: Still modifying... [id=/subscriptions/85b3dbca-5974-4067-9669-...soft.Kusto/Clusters/kustoclusteryun111, 20s elapsed]
azurerm_kusto_cluster.example: Still modifying... [id=/subscriptions/85b3dbca-5974-4067-9669-...soft.Kusto/Clusters/kustoclusteryun111, 30s elapsed]
azurerm_kusto_cluster.example: Still modifying... [id=/subscriptions/85b3dbca-5974-4067-9669-...soft.Kusto/Clusters/kustoclusteryun111, 40s elapsed]
azurerm_kusto_cluster.example: Still modifying... [id=/subscriptions/85b3dbca-5974-4067-9669-...soft.Kusto/Clusters/kustoclusteryun111, 50s elapsed]
azurerm_kusto_cluster.example: Still modifying... [id=/subscriptions/85b3dbca-5974-4067-9669-...soft.Kusto/Clusters/kustoclusteryun111, 1m0s elapsed]
azurerm_kusto_cluster.example: Modifications complete after 1m7s [id=/subscriptions/85b3dbca-5974-4067-9669-67a141095a76/resourceGroups/KustoRGyun/providers/Microsoft.Kusto/Clusters/kustoclusteryun111]
azurerm_kusto_database_principal_assignment.example: Creating...
azurerm_kusto_database_principal_assignment.example: Still creating... [10s elapsed]
azurerm_kusto_database_principal_assignment.example: Still creating... [20s elapsed]
azurerm_kusto_database_principal_assignment.example: Still creating... [30s elapsed]
azurerm_kusto_database_principal_assignment.example: Creation complete after 36s [id=/subscriptions/85b3dbca-5974-4067-9669-67a141095a76/resourceGroups/KustoRGyun/providers/Microsoft.Kusto/Clusters/kustoclusteryun111/Databases/KustoDatabaseyun111/PrincipalAssignments/KustoPrincipalAssignmentyun111]

Apply complete! Resources: 2 added, 1 changed, 0 destroyed.